contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testNestedWithNullsMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:it.imolinfo.jbi4cics.test.webservices.utils.generators" xmlns:gen="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
   <soapenv:Body>
      <urn:provaNestedOperation>
         <urn:in0>
            <!--Optional:-->
            <gen:DFHCOMMAREA>
               <!--Optional:-->
               <gen:CA_RETCODE></gen:CA_RETCODE>
               <!--Optional:-->
               <gen:CA_SWSECI1_COMMAREA>
                  <!--Optional:-->
                  <gen:CA_CICS_ABSTIME></gen:CA_CICS_ABSTIME>
                  <!--Optional:-->
                  <gen:CA_CURRENT_DATE></gen:CA_CURRENT_DATE>
                  <!--Optional:-->
                  <gen:CA_CURRENT_TIME></gen:CA_CURRENT_TIME>
                  <!--Optional:-->
                  <gen:CA_ERROR_MESSAGE></gen:CA_ERROR_MESSAGE>
                  <!--Optional:-->
                  <gen:CA_NUMBER_OF_ROWS></gen:CA_NUMBER_OF_ROWS>
               </gen:CA_SWSECI1_COMMAREA>
            </gen:DFHCOMMAREA>
         </urn:in0>
      </urn:provaNestedOperation>
   </soapenv:Body>
</soapenv:Envelope>